from opsdroid.matchers import match_regex
from opsdroid.skill import Skill


class GuideSkill(Skill):
    @match_regex(r"guide|راهنما")
    async def provide_guide(opsdroid, config, message):
        await message.respond(guide)


guide = """
راهنمای دستیار مدیریت رویداد ها و وقایع

این راهنما در استفاده بهتر از دستیار و وارد کردن رویداد هایتان به شما کمک میکند .
در ابتدا نیاز است با استفاده از کلمات "شروع/استارت" دستیار را فعال کنید.

* ایجاد رویداد *
برای ایجاد یک رویداد میتوانید از کلمات کلیدی زیر استفاده کنید :
فراموش / یادآوری /یاداوری / نیاز / حواسم / یادم / خاطرم
به عنوان مثال  : حواسم باشه که سه شنبه هفته ی آینده امتحان پردازش زبان طبیعی دارم.


*بروزرسانی رویداد *
برای بروز رسانی رویداد خود میتوانید از کلمات کلیدی زیر استفاده کنید :
آپدیت / تغییر / به روزرسانی / بروزرسانی
به عنوان مثال : تاریخ تمرین دهم تغییر کرد.

 
* لغو رویداد *
برای آنکه اگر میخواهید رویدادی را که ثبت کرده اید لغو کنید بهتر است از کلمات کلیدی زیر در متن خود استفاده کنید:
کنسل / منتفی / کنکل / لغو
به عنوان مثال : ورکشاپ چگونه پولدار شویم هفته ی آینده کنسل شد.

*انجام شدن رویداد*
اگر شما رویدادی را انجام دادید و میخواهید به دستیار خود این را اطلاع دهید تا آن رویداد را انجام شده در نظر بگیرد میتوانید از کلمات کلیدی زیر استفاده کنید :
پایان / تمام / انجام
به عنوان مثال : تمرینات درس پردازش زبان طبیعی انجام شد.

* یادآوری رویداد ها *
همچنین شما میتوانید برای زمان و تکراری که به رویدادتان میخواهید اختصاص دهید از لغات کلیدی زیر استفاده کنید :
فردا / امروز / ماهانه / هفتگی / هر دو روز / هر روز / روزانه
به عنوان مثال : هر دو روز یک بار باید ورزش کنم.


*زمان انجام رویداد*
اگر شما می‌خواهید رویداد خود را بطور دقیق همراه با زمان ذکر کنید، میتوانید از کلمات کلیدی زیر استفاده کنید :
زمان / ساعت
به عنوان مثال : من فردا ساعت ۷ صبح کلاس پردازش زبان طبیعی دارم.
"""